## Table of Contents
* [Schema](#data_schema)
* [Trim,Coalesce,Replace,Cast,Datepart ](#data_cleaning)
* [Joins](#data_exploration)
* [Groupby](#data_groupby)
* [Sub Query - With & Without Materialized tables](#data_subquery)
* [Window Functions](#data_window)
* [CTE](#data_cte)
* [Recursive_CTE](#data_recursive_cte)
* [Pivot](#data_pivot)

In [134]:
#Connection strings
from sqlalchemy import create_engine
%load_ext sql
%sql mysql://root:password@localhost/employees

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Database Schema
<a id="data_schema"></a>

![Schema](Schema.png "Database Schema")

### Data Cleaning & Transformation
<a id="data_cleaning"></a>
In this we trim the spaces in names, replace special characters, replace null with 'John' and take month

In [45]:
%%sql
SELECT Concat(Substring(last_name, 1, 1), " ", Coalesce(Trim(first_name), "John")) AS 'Short Name', 
       Extract(month FROM hire_date) AS Hire_month, 
       Floor(Datediff(Cast("2020-05-22" AS date), hire_date) / 7)  AS Tenure_in_weeks, 
       REPLACE(REPLACE(gender, 'M', 'Male'), 'F', 'Female') AS Gender 
FROM   employees 
LIMIT  5;

 * mysql://root:***@localhost/employees
5 rows affected.

[('F Georgi', 6, 1769, 'Male'),
 ('S Bezalel', 11, 1800, 'Female'),
 ('B Parto', 8, 1760, 'Male'),
 ('K Chirstian', 12, 1746, 'Male'),
 ('M Kyoichi', 9, 1601, 'Male')]

### Joins
<a id="data_exploration"></a>
Top 5 oldest employees with their Salary, Department Name and Manager Name on 1994/04/16

In [50]:
%%sql
SELECT
  e.emp_no AS emp_no,
  CONCAT (e.first_name, " ", e.last_name) AS emp_name,
  CASE  when e.gender = "M" then "Male" 
        when e.gender = "F" then "Female" 
        else  'NA' 
  END as emp_gender,
  s.salary AS emp_salary,
  d.dept_name AS department_name,
  CONCAT (em.first_name, " ", em.last_name) AS manager_name
FROM
  (
    SELECT * FROM employees ORDER BY hire_date LIMIT 5
  ) AS e
  LEFT JOIN salaries AS s USING (emp_no)
  LEFT JOIN dept_emp AS de ON e.emp_no = de.emp_no
  LEFT JOIN departments AS d ON de.dept_no = d.dept_no
  LEFT JOIN dept_manager AS dm ON d.dept_no = dm.dept_no
  LEFT JOIN employees AS em ON dm.emp_no = em.emp_no
WHERE
  "1994-04-16" BETWEEN s.from_date
  AND s.to_date
  AND "1994-04-16" BETWEEN de.from_date
  AND de.to_date
  AND "1994-04-16" BETWEEN dm.from_date
  AND dm.to_date;

 * mysql://root:***@localhost/employees
5 rows affected.

[(110022, 'Margareta Markovitch', 'Male', 92165, 'Marketing', 'Vishwani Minakawa'),
 (110511, 'DeForest Hagimont', 'Male', 64431, 'Development', 'Leon DasSarma'),
 (110303, 'Krassimir Wegerle', 'Female', 59135, 'Production', 'Shem Kieras'),
 (110085, 'Ebru Alpin', 'Male', 72727, 'Finance', 'Isamu Legleitner'),
 (110183, 'Shirish Ossenbruggen', 'Female', 63190, 'Human Resources', 'Karsten Sigstam')]

### Group by
<a id="data_groupby"></a>
Departments with at least 10000 employees as on 1994-04-16

In [32]:
%%sql
select
  d.dept_name as dept_name,
  count(e.emp_no) as no_of_employees
from
  employees as e
  left join dept_emp as de using (emp_no)
  left join departments as d using (dept_no)
where
  '1994-04-16' between de.from_date
  and de.to_date
group by
  d.dept_name
having
  no_of_employees >= 10000

 * mysql://root:***@localhost/employees
5 rows affected.

[('Development', 46132),
 ('Production', 37961),
 ('Research', 10176),
 ('Customer Service', 10643),
 ('Sales', 28176)]

### Sub Queries - With & Without Materialized tables
<a id="data_subquery"></a>

No. of titles Ebru Alpin holded in his career

#### Without Materialized Table

In [70]:
%%sql
SELECT e.first_name,
       e.last_name,

  (SELECT count(DISTINCT title)
   FROM titles AS t
   WHERE e.emp_no = t.emp_no) AS no_of_titles
FROM employees AS e
WHERE e.first_name = "Ebru"
  AND e.last_name like "Alp%"

 * mysql://root:***@localhost/employees
1 rows affected.

[('Ebru', 'Alpin', 2)]

#### With Materialized table

In [72]:
%%sql
SELECT e.first_name,
       e.last_name,
       count(DISTINCT t.title) AS no_of_titles
FROM employees AS e
LEFT JOIN titles AS t USING (emp_no)
WHERE e.first_name = "Ebru"
  AND e.last_name = "Alpin"
GROUP BY e.first_name,
         e.last_name

 * mysql://root:***@localhost/employees
1 rows affected.

[('Ebru', 'Alpin', 2)]

### Window Functions
<a id="data_window"></a>

Average Department Salary, Rank in the department, Previous hire date in the department

In [127]:
%%sql
SELECT e.first_name,
       e.last_name,
       d.dept_name,
       s.salary,
       round(avg(s.salary) OVER (PARTITION BY de.dept_no),0) AS avg_dep_salary,
       dense_rank() OVER (PARTITION BY de.dept_no
                          ORDER BY s.salary DESC) AS rank_in_dept,
                         e.hire_date,
                         lag(hire_date) OVER (PARTITION BY de.dept_no
                                              ORDER BY e.hire_date) AS prev_hire_date_in_dept
FROM employees AS e
LEFT JOIN salaries AS s USING (emp_no)
LEFT JOIN dept_emp AS de USING (emp_no)
LEFT JOIN departments AS d USING (dept_no)
WHERE '1994-04-16' BETWEEN s.from_date AND s.to_date
  AND '1994-04-16' BETWEEN de.from_date AND de.to_date
ORDER BY first_name,
         last_name
LIMIT 5

 * mysql://root:***@localhost/employees
5 rows affected.

[('Aamer', 'Armand', 'Quality Management', 49067, Decimal('54356'), 5551, datetime.date(1990, 9, 15), datetime.date(1990, 9, 14)),
 ('Aamer', 'Azevdeo', 'Customer Service', 44851, Decimal('53909'), 7094, datetime.date(1991, 6, 28), datetime.date(1991, 6, 28)),
 ('Aamer', 'Azuma', 'Quality Management', 54560, Decimal('54356'), 3777, datetime.date(1989, 12, 10), datetime.date(1989, 12, 9)),
 ('Aamer', 'Baak', 'Sales', 62831, Decimal('78025'), 18023, datetime.date(1994, 3, 10), datetime.date(1994, 3, 10)),
 ('Aamer', 'Baaleh', 'Development', 60932, Decimal('56681'), 10815, datetime.date(1989, 8, 6), datetime.date(1989, 8, 6))]

### Common Table Expressions

<a id="data_cte"></a>

Adding Median department salary - CTEs are useful over sub queries not only to beautify the code but also when the same sub query needs to run more than once

In [126]:
%%sql
WITH emp_snap_shot AS
  (SELECT e.*,
          s.salary,
          de.dept_no,
          d.dept_name
   FROM employees AS e
   LEFT JOIN salaries AS s USING (emp_no)
   LEFT JOIN dept_emp AS de USING (emp_no)
   LEFT JOIN departments AS d USING (dept_no)
   WHERE '1994-04-16' BETWEEN s.from_date AND s.to_date
     AND '1994-04-16' BETWEEN de.from_date AND de.to_date )
SELECT first_name,
       last_name,
       dept_name,
       salary,
       round(avg(salary) OVER (PARTITION BY dept_no),0) AS avg_dep_salary,
       dept_med.med_salary AS med_dep_salary,
       dense_rank() OVER (PARTITION BY dept_no
                          ORDER BY salary DESC) AS rank_in_dept,
                         hire_date,
                         lag(hire_date) OVER (PARTITION BY dept_no
                                              ORDER BY hire_date) AS prev_hire_date_in_dept
FROM emp_snap_shot
LEFT JOIN
  (SELECT dept_no,
          avg(salary) AS med_salary
   FROM
     (SELECT dept_no,
             salary,
             PERCENT_RANK() OVER (PARTITION BY dept_no
                                  ORDER BY salary DESC) AS pct
      FROM emp_snap_shot) a
   WHERE pct=0.5
   GROUP BY dept_no) dept_med USING (dept_no)
ORDER BY first_name,
         last_name
LIMIT 5;

 * mysql://root:***@localhost/employees
5 rows affected.

[('Aamer', 'Armand', 'Quality Management', 49067, Decimal('54356'), None, 5551, datetime.date(1990, 9, 15), datetime.date(1990, 9, 14)),
 ('Aamer', 'Azevdeo', 'Customer Service', 44851, Decimal('53909'), None, 7094, datetime.date(1991, 6, 28), datetime.date(1991, 6, 28)),
 ('Aamer', 'Azuma', 'Quality Management', 54560, Decimal('54356'), None, 3777, datetime.date(1989, 12, 10), datetime.date(1989, 12, 9)),
 ('Aamer', 'Baak', 'Sales', 62831, Decimal('78025'), None, 18023, datetime.date(1994, 3, 10), datetime.date(1994, 3, 10)),
 ('Aamer', 'Baaleh', 'Development', 60932, Decimal('56681'), Decimal('54629.0000'), 10815, datetime.date(1989, 8, 6), datetime.date(1989, 8, 6))]

### Recursive CTE

<a id="data_recursive_cte"></a>

Database - List of courses and their prerequisites.


Question - Get the course & the semester in which would be eligible to take the course (as semester, starting with 1) based on the prerequisite courses

![Schema_Recursive](Recursive_Schema.png "Title")

In [130]:
%sql mysql://root:password@localhost/umn_cs_prereqs

In [131]:
%%sql
WITH RECURSIVE pre_course AS
  (SELECT c.course_id,
          c.course_desc,
          p.prereq_course_id
   FROM prerequisite AS p
   JOIN course AS c ON c.course_id = p.course_id
   UNION ALL SELECT c2.course_id,
                    c2.course_desc,
                    p2.prereq_course_id
   FROM prerequisite AS p2
   JOIN course AS c2 ON c2.course_id = p2.course_id
   JOIN pre_course AS cp1 ON cp1.course_id = p2.prereq_course_id)
SELECT course_desc,
       prereq_course_id,
       count(prereq_course_id) OVER (PARTITION BY course_desc) AS semester
FROM pre_course;

   mysql://root:***@localhost/employees
 * mysql://root:***@localhost/umn_cs_prereqs
11 rows affected.

[('Advanced Programming Principles', 'CSCI 2011', 2),
 ('Advanced Programming Principles', 'CSCI 2011', 2),
 ('Algorithms and Data Structures', 'CSCI 2011', 4),
 ('Algorithms and Data Structures', 'CSCI 1933', 4),
 ('Algorithms and Data Structures', 'CSCI 1933', 4),
 ('Algorithms and Data Structures', 'CSCI 2011', 4),
 ('Calc II', 'MATH 1271', 1),
 ('Discrete Structures', 'MATH 1271', 1),
 ('Elementary Computation', 'MATH 1271', 2),
 ('Elementary Computation', 'CSCI 1133', 2),
 ('Intro to CS II', 'CSCI 1133', 1)]